hungytbshort-cell/Flipper-Zero-ESP32-Port/applications/main/nrf24/scenes/scene_menu.c
#include "../nrf24_app.h"
#include "../helpers/nrf24_jam_presets.h"

enum SubmenuIndex {
    SubmenuIndexSpectrum,
    SubmenuIndexJammer,
    SubmenuIndexBleJammer,
    SubmenuIndexMouseJacker,
};

static void nrf24_scene_menu_submenu_callback(void* context, uint32_t index) {
    Nrf24App* app = context;
    view_dispatcher_send_custom_event(app->view_dispatcher, index);
}

void nrf24_app_scene_menu_on_enter(void* context) {
    Nrf24App* app = context;

    submenu_add_item(
        app->submenu,
        "Spectrum Analyzer",
        SubmenuIndexSpectrum,
        nrf24_scene_menu_submenu_callback,
        app);
    submenu_add_item(
        app->submenu, "Jammer", SubmenuIndexJammer, nrf24_scene_menu_submenu_callback, app);
    submenu_add_item(
        app->submenu, "BLE Jammer", SubmenuIndexBleJammer, nrf24_scene_menu_submenu_callback, app);
    submenu_add_item(
        app->submenu,
        "MouseJacker",
        SubmenuIndexMouseJacker,
        nrf24_scene_menu_submenu_callback,
        app);

    view_dispatcher_switch_to_view(app->view_dispatcher, Nrf24ViewSubmenu);
}

bool nrf24_app_scene_menu_on_event(void* context, SceneManagerEvent event) {
    Nrf24App* app = context;
    bool consumed = false;

    if(event.type == SceneManagerEventTypeCustom) {
        switch(event.event) {
        case SubmenuIndexSpectrum:
            scene_manager_next_scene(app->scene_manager, Nrf24AppSceneSpectrum);
            consumed = true;
            break;
        case SubmenuIndexJammer:
            scene_manager_next_scene(app->scene_manager, Nrf24AppSceneJam);
            consumed = true;
            break;
        case SubmenuIndexBleJammer:
            /* Jump straight into the BLE-advertising jam (Protocol/BLE-Adv); the
             * preset's saved config defaults to a parked CW carrier. */
            app->jam.source = Nrf24SourceProtocol;
            app->jam.protocol = Nrf24JamPresetBleAdv;
            app->jam.resume_running = false;
            scene_manager_next_scene(app->scene_manager, Nrf24AppSceneJam);
            consumed = true;
            break;
        case SubmenuIndexMouseJacker:
            scene_manager_next_scene(app->scene_manager, Nrf24AppSceneMjMenu);
            consumed = true;
            break;
        default:
            break;
        }
    }

    return consumed;
}

void nrf24_app_scene_menu_on_exit(void* context) {
    Nrf24App* app = context;
    submenu_reset(app->submenu);
}
